FlyAirways/app/controllers/airports_controller.rb

  def find
    @airports = Airport.find_all_by_name(params[:search_string])
---
SELECT * FROM `airports` WHERE (`airports`.`name` = 'getwick')

  def index
    @airports = Airport.all
---
SELECT * FROM `airports`

  def show
    @airport = Airport.find(params[:id])
---
SELECT * FROM `airports` WHERE (`airports`.`id` = 1)

  def edit
    @airport = Airport.find(params[:id])
---
SELECT * FROM `airports` WHERE (`airports`.`id` = 1)

  def create
    @airport = Airport.new(params[:airport])

    respond_to do |format|
      if @airport.save
---
INSERT INTO `airports` (`name`, `contact_no`, `updated_at`, `address`, `created_at`) VALUES('hethrow', 870, '2010-10-28 13:09:35', '234 Bath Rd, Harlington, Hayes, Middlesex.', '2010-10-28 13:09:35')

  def update
    @airport = Airport.find(params[:id])
---
SELECT * FROM `airports` WHERE (`airports`.`id` = 1)

  def destroy
    @airport = Airport.find(params[:id])
    @airport.destroy
---
SELECT * FROM `airports` WHERE (`airports`.`id` = 5)
DELETE FROM `airports` WHERE `id` = 5