FlyAirways/app/controllers/flights_controller.rb

  def show
    @flight=Flight.find(params[:id])
---
SELECT * FROM `flights` WHERE (`flights`.`id` = 1)

  def payment
    @curr_user=get_currentUser
    @user = User.find(@curr_user.id)
    @flight=Flight.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `flights` WHERE (`flights`.`id` = 4)

  def paid

      @flight_instArr = FlightInst.find(:all,:conditions=>['flight_id=?',params[:id]])
      @flight_inst=@flight_instArr[0]

    if @flight_inst.seat_availablity!=0
      @curr_user=get_currentUser
      puts "Current user"

      @user = User.find(@curr_user.id)
      puts @user.id
      #insert into seat
          @seat=Seat.new
          @seat.flight_inst_id=@flight_inst.id
          @seat.user_id=@user.id
          puts "seats 2"

          if   @seat.save
               puts "seats saved 2"
                #update seat_availability
                  @flight_inst.seat_availablity=@flight_inst.seat_availablity-1
                  puts @flight_inst.seat_availablity
                  @flight_inst.update_attribute(:seat_availablity,@flight_inst.seat_availablity)
---
SELECT * FROM `flight_insts` WHERE (flight_id='4')
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `seats` (`updated_at`, `user_id`, `flight_inst_id`, `created_at`) VALUES('2010-10-31 23:47:12', 1, 37, '2010-10-31 23:47:12')
UPDATE `flight_insts` SET `seat_availablity` = 39, `updated_at` = '2010-11-01 00:01:13' WHERE `id` = 37

  def index
    @flights=Flight.find(:all,:conditions=>["destination=?","nowhere"])
---
SELECT * FROM `flights` WHERE (destination='nowhere')

  def create
      @flight=Flight.new(params[:flight])
     # @flight.destination=params[:flight][:destination]
      #@flight.source=params[:flight][:source]
       if @flight.save
---
INSERT INTO `flights` (`updated_at`, `price`, `flight_name`, `destination_id`, `arrival`, `baggage_allowance`, `capacity`, `source_id`, `departure`, `created_at`) VALUES('2010-10-28 17:13:49', 500, 'emirats', 1, '2010-10-31 18:13:00', 100, 22, 2, '2010-10-15 18:13:00', '2010-10-28 17:13:49')

  def edit
    @flight=Flight.find(params[:id])
---
SELECT * FROM `flights` WHERE (`flights`.`id` = 2)

  def update
      @flight=Flight.find(params[:id])
      if @flight.update_attributes(params[:flight])
---
SELECT * FROM `flights` WHERE (`flights`.`id` = 2)
UPDATE `flights` SET `flight_name` = 'kingfisher', `updated_at` = '2010-10-26 07:02:15' WHERE `id` = 2

  def delete
    @flight=Flight.find(params[:id])
    @flight.delete
---
SELECT * FROM `flights` WHERE (`flights`.`id` = 1)
DELETE FROM `flights` WHERE (`id` IN (1))

  def find
    session[:search_date]=params[:flight][:date]

      if session[:search_date].nil?
            flash[:notice] = "Please provide search date."
      else
          @flights=Flight.find(:all, :conditions =>["destination=? and source=? ",params[:flight][:destination],params[:flight][:source]])
        #  puts @flights[0].departure_time.to_s(:time)
          if @flights.size == 0
---
SELECT * FROM `flights` WHERE (flight_name='Flight name' or destination='' or source='' or departure='' or arrival='select date & Time')
SELECT * FROM `flights`

  def check_availability
    puts "in check ######"
    puts session[:search_date]

    @flight=Flight.find(params[:id])

    @flight_instArray = FlightInst.find(:all,:conditions =>["flight_id=? and date=?",params[:id],session[:search_date]])
    @flight_inst = @flight_instArray[0]
    puts "{{{{{{{{{{{{{{@flight_inst.size"
    puts @flight_instArray.size
    puts "{{{{{{{{{{{{{{@flight_inst.size"

    if @flight_instArray.size > 0
      puts "data exist&&&&"
      #show seat_available & book link

      @avail=@flight_inst.seat_availablity
      puts "avail ^^^^^^^^^^^"
      puts @avail
      render :template => "/flights/check_availability"
    else
      puts "data not&&&"
      @flight_inst = FlightInst.new
      #get capacity from flight and save as seat_availablity with given date and id
      @flight_inst.flight_id=params[:id]
      @flight_inst.seat_availablity = @flight.capacity
      @flight_inst.date=session[:search_date]
      @flight_inst.save
---
SELECT * FROM `flights` WHERE (`flights`.`id` = '--- :capacity\n') LIMIT 1
SELECT * FROM `flight_insts` WHERE (flight_id='1' and date='2010-10-31') LIMIT 1
INSERT INTO `flight_insts` (`updated_at`, `flight_id`, `date`, `seat_availablity`, `created_at`) VALUES('2010-10-31 14:43:28', 1, NULL, 40, '2010-10-31 14:43:28')