FlyAirways/app/controllers/seats_controller.rb

  def show
    @seat=Seat.find(params[:id])
---
SELECT * FROM `seats` WHERE (`seats`.`id` = 0)

  def create

    @seat = Seat.new(params[:seat])
    if @seat.save
---
INSERT INTO `seats` (`name`, `contact_no`, `updated_at`, `flight_id`, `baggage`, `address`, `created_at`) VALUES('shrida', 4, '2010-10-26 07:48:33', 2, 40, 'surrey', '2010-10-26 07:48:33')

  def edit
    @seat = Seat.find(params[:id])
---
SELECT * FROM `seats` WHERE (`seats`.`id` = 8)

  def update
      @seat = Seat.find(params[:id])
      @seat.update_attributes(params[:seat])
---
SELECT * FROM `seats` WHERE (`seats`.`id` = 8)
UPDATE `seats` SET `flight_id` = 5, `updated_at` = '2010-10-26 11:04:45' WHERE `id` = 8

  def delete
    @seat = Seat.find(params[:id])
    @seat.delete
---
SELECT * FROM `seats` WHERE (`seats`.`id` = 5)
DELETE FROM `seats` WHERE (`id` IN (5))

  def flight_seats
    @flight=Flight.find(params[:flight_id])
---
SELECT * FROM `flights` WHERE (`flights`.`id` = 9)