FlyAirways/app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (user_name = 'shrida' and password = 's') LIMIT 1
---
  def authenticate
     @user = User.new(params[:userform])
     valid_user = User.find(:first,:conditions => ["email = ? and password = ?",@user.email, @user.password])

SELECT * FROM `users` WHERE (`users`.`email` = 'j@mail.com') LIMIT 1
---
  def edit_password
       @user = User.find_by_email(session[:user_id])

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'j@mail.com' AND `users`.id <> 2) LIMIT 1
UPDATE `users` SET `password` = 'd', `updated_at` = '2010-10-29 13:14:41' WHERE `id` = 1
---
  def update_password
    puts "--------------------update"
     @user = User.find_by_email(session[:user_id])
     puts "--------------------update"
      puts @user

    #respond_to do |format|
       if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`email` = 'shrida') LIMIT 1
SELECT * FROM `users`
---
  def index
    if is_customer? or is_employee?
          @users = User.find_all_by_email(session[:user_id])
    elsif is_admin?
          @users = User.all

INSERT INTO `users` (`contact_no`, `l_name`, `updated_at`, `title`, `f_name`, `role`, `security_code`, `payment_type`, `address`, `password`, `card_no`, `exp_date`, `issue_date`, `email`, `created_at`) VALUES(987463235, 'reid', '2010-11-01 10:01:30', 'Mrs', 'jhon', 'customer', 1231, 'Master card', 'belfast,uk.', 'password', 3213, '2010-11-01', '2010-11-01', 'j@mail.com', '2010-11-01 10:01:30')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `email_add` = 'sid@mail.com', `first_name` = 'sid', `updated_at` = '2010-10-29 10:38:57' WHERE `id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])